Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничныйНалог</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СистемыНалогообложения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.СистемыНалогообложения.Общая, "Общеустановленная");
	Если Параметры.Период <= Дата('20251231') Тогда
		ДанныеВыбора.Добавить(Перечисления.СистемыНалогообложения.РозничныйНалог, "Розничный налог");
	КонецЕсли;
	
	Если НЕ ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
		ДанныеВыбора.Добавить(Перечисления.СистемыНалогообложения.Упрощенная, "Упрощенная");
	КонецЕсли;
	
	// для юрлиц режим всегда был как общеустановленный
	// для ИП рассчет до 2021 не поддерживался, но расчет по ИП могли производить
	Если Параметры.Свойство("ОрганизацияЯвляетсяИП")
		И Параметры.Свойство("Период")
		И Параметры.ОрганизацияЯвляетсяИП
		// после 2021 года режиму налогообложения должен быть заполнен, поддерживаем только переходный период 2021 года
		И Параметры.Период >= Дата('20210101')
		И Параметры.Период <= Дата('20211231') Тогда
		
		ДанныеВыбора.Добавить(Перечисления.СистемыНалогообложения.ПустаяСсылка(), НСтр("ru = '<не установлен>'"));
		
	КонецЕсли;
	
КонецПроцедуры
	
#КонецЕсли
